tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "httpie"
brew "jq"
brew "n"
brew "neovim"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "tree"
brew "vercel-cli"
brew "yadm"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
cask "alt-tab"
cask "betterdisplay"
cask "bitwarden"
cask "brave-browser"
cask "cleanshot"
cask "figma"
cask "font-inter"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "latest"
cask "meetingbar"
cask "messenger"
cask "notion"
cask "onyx"
cask "rapidapi"
cask "raycast"
cask "readdle-spark"
cask "slack"
cask "sonos"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "bennycode.sort-everything"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coachrichbart.better-jest"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "gruntfuggly.todo-tree"
vscode "jacobdufault.fuzzy-search"
vscode "jasonnutter.search-node-modules"
vscode "jdinhlife.gruvbox"
vscode "kahole.magit"
vscode "lokalise.i18n-ally"
vscode "marclipovsky.string-manipulation"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "pkief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "raunofreiberg.vesper"
vscode "rebornix.toggle"
vscode "redhat.vscode-yaml"
vscode "ryuta46.multi-command"
vscode "sburg.vscode-javascript-booster"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "wraith13.file-path-bar"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
