tap "eddieantonio/eddieantonio"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "shivammathur/php"
tap "wip-tech/wip"
tap "withgraphite/tap"
brew "awscli"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-standup"
brew "gitui"
brew "gnu-sed"
brew "gum"
brew "httpie"
brew "jless"
brew "jq"
brew "lf"
brew "n"
brew "neofetch"
brew "neovim"
brew "pnpm"
brew "ripgrep"
brew "sd"
brew "sl"
brew "starship"
brew "tldr"
brew "tree"
brew "ugit"
brew "vercel-cli"
brew "yadm"
brew "yazi"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
brew "withgraphite/tap/graphite"
cask "alt-tab"
cask "amazon-q"
cask "arc"
cask "betterdisplay"
cask "bitwarden"
cask "brave-browser"
cask "cleanshot"
cask "cloudflare-warp"
cask "devtoys"
cask "discord"
cask "fig"
cask "figma"
cask "firefox"
cask "font-geist-mono"
cask "font-inter"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "grammarly-desktop"
cask "hiddenbar"
cask "iina"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "latest"
cask "meetingbar"
cask "messenger"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "ollama"
cask "onyx"
cask "postman"
cask "rapidapi"
cask "rar"
cask "raycast"
cask "readdle-spark"
cask "rocket"
cask "slack"
cask "spaceid"
cask "spotify"
cask "tableplus"
cask "todoist"
cask "via"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bennycode.sort-everything"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coachrichbart.better-jest"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "gruntfuggly.todo-tree"
vscode "jacobdufault.fuzzy-search"
vscode "jasonnutter.search-node-modules"
vscode "jdinhlife.gruvbox"
vscode "kahole.magit"
vscode "lokalise.i18n-ally"
vscode "marclipovsky.string-manipulation"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "pkief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "raunofreiberg.vesper"
vscode "rebornix.toggle"
vscode "redhat.vscode-yaml"
vscode "ryuta46.multi-command"
vscode "sburg.vscode-javascript-booster"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sumneko.lua"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "wraith13.file-path-bar"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
