tap "anomalyco/tap"
tap "code-yeongyu/tap"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "manaflow-ai/cmux"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "steipete/tap"
tap "tw93/tap"
tap "withgraphite/tap"
brew "actionlint"
brew "agent-browser"
brew "ast-grep"
brew "bat"
brew "btop"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-who"
brew "gitui"
brew "helix"
brew "httpie"
brew "jless"
brew "jq"
brew "mise"
brew "neovim"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "tree"
brew "typescript-language-server"
brew "uv"
brew "vercel-cli"
brew "yadm"
brew "yaml-language-server"
brew "zoxide"
brew "anomalyco/tap/opencode"
brew "code-yeongyu/tap/comment-checker"
brew "oven-sh/bun/bun"
brew "tw93/tap/mole"
brew "withgraphite/tap/graphite"
cask "nikitabobko/tap/aerospace"
cask "alt-tab"
cask "betterdisplay"
cask "bitwarden"
cask "brave-browser"
cask "claude"
cask "cleanshot"
cask "clop"
cask "cmux"
cask "codex"
cask "steipete/tap/codexbar"
cask "commander"
cask "cursor"
cask "figma"
cask "firefox"
cask "font-commit-mono-nerd-font"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "helium-browser"
cask "iina"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kindavim"
cask "latest"
cask "messenger"
cask "ngrok"
cask "notion"
cask "onyx"
cask "opencode-desktop"
cask "orbstack"
cask "rapidapi"
cask "raycast"
cask "readdle-spark"
cask "slack"
cask "sonos"
cask "spotify"
cask "tailscale-app"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "bennycode.sort-everything"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coachrichbart.better-jest"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "gruntfuggly.todo-tree"
vscode "jacobdufault.fuzzy-search"
vscode "jasonnutter.search-node-modules"
vscode "jdinhlife.gruvbox"
vscode "kahole.magit"
vscode "lokalise.i18n-ally"
vscode "marclipovsky.string-manipulation"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "pkief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "raunofreiberg.vesper"
vscode "rebornix.toggle"
vscode "redhat.vscode-yaml"
vscode "ryuta46.multi-command"
vscode "sburg.vscode-javascript-booster"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "wraith13.file-path-bar"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
